app/views/search/search.html.haml

                          %strong Keywords:
                        - @keywords[profile.user_id].each do |keyword|
---
SELECT "users".* FROM "users" LIMIT 1