app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
---
	def main
		@users = User.all