app/controllers/admin_controller.rb

	def main
		@status = Status.all
		urole = Urole.find_by_code('USER')
		@users = urole.users
		@susers = Suser.all
---
SELECT "status".* FROM "status"
SELECT "users".* FROM "users"

	def approve_all
		fromStatus = Status.where(code: 'PAPP').first
---
SELECT "status".* FROM "status" WHERE "status"."code" = 'PAPP' LIMIT 1

	def add_users
		email = params[:userEmail]
		Suser.insert_suser(email)
---
INSERT INTO "susers" ("activation_link", "active_till", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "users" ("activation_date", "created_at", "email", "password", "status_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["activation_date", nil], ["created_at", Sat, 08 Nov 2014 19:46:30 UTC +00:00], ["email", "abc@xyz.com"], ["password", "a"], ["status_id", 5], ["updated_at", Sat, 08 Nov 2014 19:46:30 UTC +00:00]]