app/controllers/search_controller.rb

  def search
    @term = params[:term]
    @profiles = []
    @istermnull = 0


    if @term.length <=2
      @istermnull = 1
    else
      @profiles=Profile.get_profiles_by_keyword(@term)
      @profiles += Profile.get_profiles_by_name(@term)
      @profiles += Profile.get_profiles_by_desc(@term)
      splitterms = @term.split(" ")

      splitterms.each do |splitterm|
        @profiles+=Profile.get_profiles_by_keyword(splitterm)

        @profiles += Profile.get_profiles_by_name(splitterm)

        @profiles += Profile.get_profiles_by_desc(splitterm)
          end

      @profiles.uniq!
      @keywords = {}
      @profiles.each do |profile|
---
SELECT "keywords".* FROM "keywords" WHERE (keywords.key LIKE '%Antiquity%') LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."keyword_id" IS NULL